src_2/bench.txt

============ Serving Benchmark Result ============
Successful requests:                     20        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  18.17     
Total input tokens:                      2827      
Total generated tokens:                  1200      
Request throughput (req/s):              1.10      
Output token throughput (tok/s):         66.05     
Peak output token throughput (tok/s):    72.00     
Peak concurrent requests:                3.00      
Total token throughput (tok/s):          221.64    
---------------Time to First Token----------------
Mean TTFT (ms):                          141.23    
Median TTFT (ms):                        80.32     
P99 TTFT (ms):                           1073.98   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.00     
Median TPOT (ms):                        12.97     
P99 TPOT (ms):                           13.20     
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.00     
Median ITL (ms):                         13.04     
P99 ITL (ms):                            14.41     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          908.22    
Median E2EL (ms):                        845.19    
P99 E2EL (ms):                           1853.00   
==================================================